# 3. Реализовать программу работы с органическими клетками. Необходимо создать класс Клетка.
# В его конструкторе инициализировать параметр, соответствующий количеству клеток (целое число).
# В классе должны быть реализованы методы перегрузки арифметических операторов: сложение (__add__()),
# вычитание (__sub__()), умножение (__mul__()), деление (__truediv__()).Данные методы должны применяться
# только к клеткам и выполнять увеличение, уменьшение, умножение и обычное (не целочисленное) деление клеток,
# соответственно. В методе деления должно осуществляться округление значения до целого числа.

# Сложение. Объединение двух клеток. При этом число ячеек общей клетки должно равняться сумме ячеек исходных
# двух клеток.
# Вычитание. Участвуют две клетки. Операцию необходимо выполнять только если разность количества ячеек
# двух клеток больше нуля, иначе выводить соответствующее сообщение.
# Умножение. Создается общая клетка из двух. Число ячеек общей клетки определяется как произведение
# количества ячеек этих двух клеток.
# Деление. Создается общая клетка из двух. Число ячеек общей клетки определяется как целочисленное деление
# количества ячеек этих двух клеток.
# В классе необходимо реализовать метод make_order(), принимающий экземпляр класса и количество ячеек в ряду.
# Данный метод позволяет организовать ячейки по рядам.
# Метод должен возвращать строку вида *****\n*****\n*****..., где количество ячеек между \n равно переданному
# аргументу. Если ячеек на формирование ряда не хватает, то в последний ряд записываются все оставшиеся.
# Например, количество ячеек клетки равняется 12, количество ячеек в ряду — 5. Тогда метод make_order() вернет
# строку: *****\n*****\n**.
# Или, количество ячеек клетки равняется 15, количество ячеек в ряду — 5. Тогда метод make_order() вернет
# строку: *****\n*****\n*****.

class Organic_Cell:
    def __init__(self, cells):
        self.cells = cells

    def __add__(self, other):
        return Organic_Cell(self.cells + other.cells)

    def __sub__(self, other):
        if self.cells <= other.cells:
            return ' '
        else:
            return Organic_Cell(self.cells - other.cells)

    def __mul__(self, other):
        return Organic_Cell(self.cells * other.cells)

    def __truediv__(self, other):
        if self.cells < other.cells:
            return ' '
        else:
            return Organic_Cell(self.cells // other.cells)

    def make_order(self, positions):
        symb = ('*' * self.cells)
        for i in range(self.cells // positions + 1):
            print(symb[(i) * positions:(i + 1) * positions])
        return ''


cell1 = Organic_Cell(2)
cell2 = Organic_Cell(3)
cell3 = Organic_Cell(14)
print(f'В результате сложения получилась клетка размера: {cell1.__add__(cell2).cells}')

try:
    print(f'В результате уменьшения получилась клетка размера {cell1.__sub__(cell2).cells}')
except:
    print('неудачная попытка уменьшения. новая клетка не создана')

try:
    print(f'В результате уменьшения получилась клетка размера {cell2.__sub__(cell1).cells}')
except:
    print('неудачная попытка уменьшения. новая клетка не создана')

try:
    print(f'В результате уменьшения получилась клетка размера {cell2.__sub__(cell2).cells}')
except:
    print('неудачная попытка уменьшения. новая клетка не создана')

try:
    print(f'В результате деления получилась клетка размера {cell1.__truediv__(cell2).cells}')
except:
    print('неудачная попытка деления. новая клетка не создана')

print(f'В результате умножения получилась клетка размера {cell1.__mul__(cell2).cells}')

cell3.make_order(5)
